# https://stepik.org/lesson/512854/step/6?unit=505068

# Напишите функцию func, используя синтаксис анонимных функций, которая принимает строковый аргумент и возвращает значение True, если переданный аргумент начинается и заканчивается на английскую букву a (регистр буквы неважен), или False в противном случае.

func = lambda x: (x[0] + x[-1]).lower() == 'aa'

print(func('abcd'))
print(func('bcda'))
print(func('abcda'))
print(func('Abcd'))
print(func('bcdA'))
print(func('abcdA'))